---
title: Lisp入門
tags:
  - CommonLisp
  - lisp
private: true
updated_at: '2020-05-10T19:31:01+09:00'
id: 9672bc6910ab111079de
organization_url_name: null
slide: false
ignorePublish: false
---
#clispの始まり

`clisp`でスタート

```
% clisp
  i i i i i i i       ooooo    o        ooooooo   ooooo   ooooo
  I I I I I I I      8     8   8           8     8     o  8    8
  I  \ `+' /  I      8         8           8     8        8    8
   \  `-+-'  /       8         8           8      ooooo   8oooo
    `-__|__-'        8         8           8           8  8
        |            8     o   8           8     o     8  8
  ------+------       ooooo    8oooooo  ooo8ooo   ooooo   8

Welcome to GNU CLISP 2.49 (2010-07-07) <http://clisp.cons.org/>

Copyright (c) Bruno Haible, Michael Stoll 1992, 1993
Copyright (c) Bruno Haible, Marcus Daniels 1994-1997
Copyright (c) Bruno Haible, Pierpaolo Bernardi, Sam Steingold 1998
Copyright (c) Bruno Haible, Sam Steingold 1999-2000
Copyright (c) Sam Steingold, Bruno Haible 2001-2010

Type :h and hit Enter for context help.
```

#数当てゲーム

defparameterでグローバル変数を定義する。

```lisp
> (defparameter *small* 1)
*SMALL*
> (defparameter *big* 100)
*BIG*
#
```

defparameterを使って定義した変数は上書きできる。

```lisp
> (defparameter *foo* 5)
*FOO*
> *foo*
5
> (defparameter *foo* 6)
*FOO*
> *foo*
6
```

ちなみにdefvarを使うと上書きできない

```lisp
> (defvar *foo* 5)
*FOO*
> *foo*
6
> (defvar *foo* 6)
*FOO*
```

guess-my-numberの定義

```lisp
> (defun guess-my-number ()
          (ash (+ *small* *big*) -1))
GUESS-MY-NUMBER
```

ashの引数を1にするとビットを１つ左にする(

```lisp
> (ash 11 1)
22
> (ash 11 -1)
5
```



```lisp
> (guess-my-number)
50
> (defun smaller ()
          (setf *big* (1- (guess-my-number)))
          (guess-my-number))
SMALLER
```

```lisp
> (defun bigger ()
                  (setf *small* (1+ (guess-my-number)))
                  (guess-my-number))
BIGGER
```

すると！

```lisp
> (bigger)
37
> (smaller)
31
```
