---
title: Lispチートシート
tags:
  - lisp
private: true
updated_at: '2021-05-31T14:01:05+09:00'
id: d1af306f3732737d448c
organization_url_name: null
slide: false
ignorePublish: false
---
#概要

Lisp(ANSI Common Lisp)の基礎をまとめてみた。

#グローバル変数

`defparameter`を使って変数を定義すると**上書き可能**。
`defvar`を使うと**上書き不可能**。

```lisp
> (defparameter *foo* 5)
*FOO*
> *foo*
5
> (defparameter *foo* 6)
*FOO*
> *foo*
6
>
> (defvar *hoge* 5)
*HOGE*
Break 2 [5]> *hoge*
5
Break 2 [5]> (defvar *hoge* 6)
*HOGE*
Break 2 [5]> *hoge*
5
```
#グローバル関数

以下は*small*と*big*を足して右に1シフトする(半分して小数部を切り捨てる)関数である。

```lisp
> (defun guess-my-number ()
         (ash (+ *small* *big*) -1))
GUESS-MY-NUMBER
> (guess-my-number)
50
```

#数当てゲーム

```lisp
> (defparameter *small* 1)
*SMALL*
> (defparameter *big* 100)
*BIG*
> (defun guess-my-number ()
         (ash (+ *small* *big*) -1))
GUESS-MY-NUMBER
>
> (defun bigger ()
         (setf *small* (1+ (guess-my-number)))
         (guess-my-number))
BIGGER
> (defun smaller ()
         (setf *big* (1- (guess-my-number)))
         (guess-my-number))
SMALLER
> (defun start-over ()
         (defparameter *small* 1)
         (defparameter *big* 100)
         (guess-my-number))
START-OVER
```

```lisp:80のときのゲーム結果
> (guess-my-number)
50
> (bigger)
75
> (bigger)
88
> (smaller)
81
> (smaller )
78
> (bigger)
79
> (bigger)
80
> (start-over) ;初期化
50
```


#ローカル変数とローカル関数

ローカル変数は`let`で定義する。

```lisp
> (let ((a 5)
            (b 6))
         (+ a b))
11
```


ローカル関数は`flet`で定義する

```lisp
 (flet ((f (n)
               (+ n 10)))
         (f 5))
15
```

ローカル関数内でローカル変数を使いたいときは`labels`を使う

```lisp
> (labels ((a (n)
                 (+ n 5))
               (b (n)
                 (+ (a n) 6)))
         (b 10))
21
```

#Lispのデータ型

##シンボル

シンボルとはアルファベット、数字、記号から構成される単語。
Common Lispでは大文字と小文字を区別しない。

```lisp
> (eq 'foo 'FoO) ;fooとFoOは等しいか
T
```

##数値

```lisp
> (+ 1 2.0) ;浮動小数点数を混ぜると浮動小数点数になる
3.0
> (/ 2 6) ;割り算は分数になる
1/3
> (+ (/ 2 6)  (/ 1 4))
7/12
> (/ 2 6.0) ;浮動小数点数を混ぜると答えも小数になる
0.33333334
```

##文字列

```lisp
> (princ "Hello Lisp") ;文字の表示
Hello Lisp
"Hello Lisp"
> (expt 2 10)  ;コードモード
1024
[20]> '(expt 2 10) ;データモード  ()の前に'をつける
(EXPT 2 10)
```

#コンスセル

##cons

2つのデータ、もしくはリストをくっつける関数

```lisp
> (cons 'x 'y)
(X . Y)
> (cons 'x ())
(X)
> (cons 'x '(y z))
(X Y Z)
> (cons 'x (cons 'y (cons 'z 'nil)))
(X Y Z)
```

##carとcdr

***car***はセルの最初のデータを取り出す。
***cdr***は2番目のデータ、もしくはリストの残りを取り出す。
***cadr***は*car + cdr*
***cdar***は*cdr + car*
***cadadr***は*car + cdr + car + cdr*

```lisp
> (car '(x y z))
X
> (cdr '(x y z))
(Y Z)
> (car (cdr '(x y z)))
Y
> (cadr '(x y z))
Y
> (cadadr '(a '(b c d)))
(B C D)
```
#空リスト

以下の4つの空は全て等価である。

```lisp
'() () nil 'nil
```

#条件分岐と比較関数など

##if

```lisp
> (if (= (+ 1 2) 3)
          'yup
          'nope)
YUP
> (if (oddp 2) ;oddpは奇数なら真となる
          'odd
          'even)
EVEN
```

***progn***を使うと最後の式の評価値を値として返す。

```lisp
> (defvar *x* nil)
*X*
> (if (oddp 3)
          (progn (setf *x* t)
                 'odd)
          'even)
ODD
> *x*
T
```

##when

```lisp
> (defvar *a* nil)
*A*
> (when (oddp 3)
          (setf *a* t)
          'odd)
ODD
> *a*
T
```

##unless

```lisp
> (unless (oddp 6)
          (setf *a* nil)
          'even)
EVEN
> *a*
NIL
```

##cond



```lisp
> (defun pudding-eater (person)
          (cond ((eq person 'henry) (setf *arch-enemy* 'stupid-lisp-alien)                              
                                   '(curse you lisp alien - you ate my pudding))
                ((eq person 'johnny) (setf *arch-enemy* 'useless-old-jonny)
                                   '(i hope you choked on my pudding johnny))
                (t '(why you eat my pudding stranger ?))))
PUDDING-EATER
> (pudding-eater 'johnny)
(I HOPE YOU CHOKED ON MY PUDDING JOHNNY)
> *arch-enemy*
USELESS-OLD-JONNY
```

##case

```lisp
> (defun name(person)
          (case person
              ((ichiro) (setf *x* 'ichi)
                        '(i am ichiro))
              ((jiro)   (setf *y* 'ni)
                        '(i am jiro))
              (otherwise '(noname))))
NAME
> (name 'ichiro)
(I AM ICHIRO)
> *x*
ICHI
> (name 'dog)
(NONAME)
```

##and

```lisp
> (and (oddp 5) (oddp 7) (oddp 9))
T
```

##or

```lisp
> (or (oddp 4) (oddp 6) (oddp 9))
T
>
> (defparameter *x* nil)
*X*
> (or (oddp 4) (setf *x* t))
T
> *x*
T
> (defparameter *y* nil)
*Y*
> (or (oddp 5) (setf *y* t))
T
> *y*
NIL
```

##member

memberはリストの中に値が含まれているかを調べる関数
探す対象の値以降の部分リストを返す。

```lisp
> (member 1 '(3 4 1 5)) 
(1 5)
> (member 1 '(3 4 1 3 5))
(1 3 5)
```

## find-if

find-ifは最初の引数に別の関数をとり、リストの中から最初に真となるものを返す。

```lisp
> (find-if #'oddp '(2 3 5 6)) ;最初の奇数を取り出す
3
```

##eqとequal

シンボル同士は***eq***で、そうでなければ***equal***で比較する。

```lisp
> (eq 'apple 'apple)
T
> (eq 'apple 'orange)
NIL
> (equal (list 1 2 3) (list 1 2 3))
T
> (equal '(1 2 3) (cons 1 (cons 2 (cons 3 ()))))
T
> (equal 4 5)
NIL
]> (equal 4.5 4.5) ;浮動小数点同士
T
> (equal "foo" "foo") ;文字列同士
T
> (equal #\a #\a) ;文字同士
T
```

##eql

***eql***は***eq***と違って数値と文字も比較できる。

```lisp
> (eql 3.4 3.4)
T
(eql #\a #\a)
T
```

##equalp

***equqlp***は大文字小文字、整数と浮動小数点数を比較できる。

```lisp
> (equalp "LISP" "Lisp")
T
> (equalp 2.0 2)
T
```



